/* Задание 1.
    Напишите программу, которая работала бы следующим образом: в prompt вводится значение. 
    С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, 
    затем проверить с помощью typeof, принадлежит ли оно к множеству Number.

    Если это число, то вывести в консоль чётное оно или нечётное.

    Если передано не число, выведите: «Упс, кажется, вы ошиблись».

    *NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.
*/

console.log("Задание 1.");
let userNumber = +prompt("Введите число: ");
if (typeof userNumber === "number" && !isNaN(userNumber)) {
  let isEven = userNumber % 2;
  switch (isEven) {
    case 0:
      console.log(userNumber + ": четное число");
      break;
    default:
      console.log(userNumber + ": нечетное число");
  }
} else console.log("Упс, кажется, вы ошиблись");
console.log("______________________________________________________");

/* в цикле  */
// let userNumber = prompt("Введите число: ");
// while (userNumber) {
//   if (typeof +userNumber === "number" && !isNaN(+userNumber)) {
//     let isEven = userNumber % 2;
//     switch (isEven) {
//       case 0:
//         console.log(userNumber + ": четное число");
//         break;
//       default:
//         console.log(userNumber + ": нечетное число");
//     }
//   } else console.log("Упс, кажется, вы ошиблись");
//   userNumber = prompt("Введите число: ");
// }
// console.log("______________________________________________________");

// ====================================================================================================================================================
/* Задание 2.
    Дана переменная Х, которая может принимать любое значение. 
    Написать программу, которая в зависимости от типа данных Х выводит в консоль сообщение вида: «X — число».

    Опишите три случая: когда х = числу, строке или логическому типу. В других случаях выводите сообщение: «Тип x не определён».
*/
console.log("Задание 2.");
let x = 1;
let type = typeof x;
console.log(`X равно: ${x}`);
switch (type) {
  case "number":
    console.log(`X - число`);
    break;
  case "string":
    console.log(`X - строка`);
    break;
  case "boolean":
    console.log(`X - логический тип`);
    break;
  default:
    console.log(`Тип X не определен`);
}
console.log("______________________________________________________");

// ====================================================================================================================================================
/* Задание 3
  Дана строка. Необходимо вывести в консоль перевёрнутый вариант. Например, "Hello" -> "olleH".
*/
console.log("Задание 3");
let str = "Hello";
console.log(str.split("").reverse().join(""));
console.log("______________________________________________________");

// ====================================================================================================================================================
/* Задание 4
  Записать в переменную случайное целое число в диапазоне [0; 100]. Используйте объект Math.
*/
console.log("Задание 4");
let random = Math.floor(Math.random() * 101);
console.log(random);
console.log("______________________________________________________");

// ====================================================================================================================================================
/* Задание 5
  Дан произвольный массив. Необходимо вывести количество элементов массива, затем перебрать его и вывести в консоль каждый элемент массива.
*/
console.log("Задание 5");
const arr = [30, 7, 90, 172, 60];
console.log(`Исходный массив: ${arr}`);
console.log(`Длина массива: ${arr.length}`);
console.log("Элементы массива");
arr.forEach((item) => console.log(item));
console.log("______________________________________________________");

// ====================================================================================================================================================
/*Задание 6.
Дан массив. Проверить, одинаковые ли элементы в массиве и вывести результат true или false в консоль. 
Речь идёт не о двух рядом стоящих одинаковых элементах, а обо всех. Проверить, все ли элементы в массиве одинаковые. 
*/
console.log("Задание 6");
const arrUnequal = [30, 7, 90, 172, 60];
const arrUnequal2 = [1, 1, 2];
const arrSame = [303, 303, 303, 303, 303];
function compare(arr) {
  let res;
  for (let i = 1; i < arr.length; i++) {
    let elem = arr[0];
    if (elem !== arr[i]) {
      res = false;
      break;
    } else {
      elem = arr[i];
      res = true;
    }
  }
  console.log(res);
}
console.log(`Массив с неодинаковыми элементами: ${arrUnequal}`);
compare(arrUnequal);
console.log(`Массив с неодинаковыми элементами: ${arrUnequal2}`);
compare(arrUnequal2);
console.log(`Массив с одинаковыми элементами: ${arrSame}`);
compare(arrSame);
console.log("______________________________________________________");

// ====================================================================================================================================================
/* Задание 7.
Дан массив. Нужно вывести в консоль количество чётных и нечётных элементов в массиве. 
Если в массиве есть нулевой элемент, то он учитывается и выводится отдельно. 
При выполнении задания необходимо учесть, что массив может содержать не только числа, 
но и, например, знаки, null и так далее. 
*/
console.log("Задание 7");
let arr7 = [0, 1, 3, "string", null, undefined, 2, "2", 4, 6, NaN, 11, 1, 0];
let evenCount = 0;
let oddCount = 0;
console.log(`Исходный массив:`);
console.log(arr7);
arr7.forEach((item, idx) => {
  if (typeof item === "number" && item !== 0 && !isNaN(item)) {
    item % 2 === 0 ? evenCount++ : oddCount++;
  } else if (item === 0) console.log(`Элемент равен: 0. Индекс: ${idx}`);
});
console.log(`Количество четных элементов: ${evenCount}`);
console.log(`Количество нечетных элементов: ${oddCount}`);
console.log("______________________________________________________");

// ====================================================================================================================================================
/*Задание 8.
Создайте произвольный массив Map. Получите его ключи и выведите в консоль все значения в виде «Ключ — Х, значение — Y».
Используйте шаблонные строки. */
let myMap = new Map([
  [1, "number"],
  ["str", "string"],
  [true, "bolean"],
  ["one", 1],
]);

let keys = myMap.keys();
for (item of myMap) {
  console.log(`Ключ - ${item[0]}, значение - ${item[1]}`);
}
console.log("______________________________________________________");
